# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [8]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [11]:
baby_names.drop(["Unnamed: 0",'Id'],axis = 1,inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [17]:
if sum(baby_names.Gender=="M") > sum(baby_names.Gender=="F"):
    print(f"there are more Male")
else:
    print("There are more female")

There are more female

### Step 7. Group the dataset by name and assign to names

In [27]:
names = baby_names.groupby("Name").Name

### Step 8. How many different names exist in the dataset?

In [33]:
len(baby_names.Name.unique())

17632

### Step 9. What is the name with most occurrences?

In [36]:
names.count().sort_values().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [37]:
names.count().sort_values().idxmin()

'Katherina'

### Step 11. What is the median name occurrence?

In [40]:
names.count().sum()/len(baby_names.Name.unique())

57.644906987295826

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [43]:
names.describe()

        count unique      top freq
Name
Aaban       2      1    Aaban    2
Aadan       4      1    Aadan    4
Aadarsh     1      1  Aadarsh    1
Aaden     196      1    Aaden  196
Aadhav      1      1   Aadhav    1
...       ...    ...      ...  ...
Zyra        7      1     Zyra    7
Zyrah       2      1    Zyrah    2
Zyren       1      1    Zyren    1
Zyria      10      1    Zyria   10
Zyriah      9      1   Zyriah    9

[17632 rows x 4 columns]